import bar from '../assets/imgs/bar.png';

export const AboutPage = () => {
  return (
    <div
      style={{
        display: 'flex',
        alignItems: 'center',
        width: '50%',
        margin: '0 auto',
        gap: '6rem',
      }}
    >
      <div>
        <h1 style={{ fontSize: '3rem', color: '#ee931b' }}>БАР 100 РЕНТГЕН</h1>
        <p style={{ fontSize: '1.2rem' }}>
          Найвідоміший сталкерський бар, про який чула вся Зона. Знаходиться на
          території бази угруповання «Борг», тож можна зрозуміти — не кожному
          відкрито вхід туди. Служить сталкерам одним із найбезпечніших місць у
          Зоні. У «100 рентген» є охорона та її часто відвідують різні сталкери.
          Бар знаходиться у підвалі, у підсобному дворі східної частини заводу
          «Росток». Біля входу гравця завжди зустрічає охоронець Жорік. На
          території бару не можна ходити зі зброєю. У приміщенні бару досить
          затишно і похмуро: барна стійка, за якою стежить Бармен, і високі
          столи, у яких стоять сталкери. Праворуч за стійкою, трохи глибше біля
          стінки стоїть інформатор. А біля проходу в "особисті покої Бармена"
          стоїть ще один охоронець - Гарік.
        </p>
      </div>
      <img src={bar} alt="Bar-img" style={{ width: '50%', height: 'auto' }} />
    </div>
  );
};
